#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-keycloak_dev/runs/run-VVef4sWKCNoj9j9f

Waiting for the plan to start...

Terraform v0.15.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_openid_client.this: Refreshing state... [id=6eed1485-6ff9-4fd0-a23c-c40fe8b4a293]
module.keycloak_prod.module.onestopauth.module.client_test-1.keycloak_openid_client.this: Refreshing state... [id=e471f8c2-3e60-47b1-b656-0b55af8aaf18]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_openid_client.this: Refreshing state... [id=cae48eb7-9213-4e01-bd6c-3692ad9bb6dc]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_openid_client.this: Refreshing state... [id=ca9ef106-21a5-45d2-bc20-625f320f50b5]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_openid_client.this: Refreshing state... [id=64bbade1-dc8a-4957-92b4-36ab257fe42c]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_openid_client.this: Refreshing state... [id=63ac5a96-4e81-4e80-aba7-79a0ea055972]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_openid_client.this: Refreshing state... [id=29c5d0d5-a078-4dd4-82f4-7a46fe58cd5d]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_openid_client.this: Refreshing state... [id=8c301040-2775-4c86-a033-3138786797e5]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_openid_client.this: Refreshing state... [id=fc71bb86-0f87-441e-ab7e-bfe0ed5fadde]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_openid_client.this: Refreshing state... [id=e511063b-6500-4cd9-ab2f-32ae0c11c824]
module.keycloak_dev.module.onestopauth.module.client_new-test.keycloak_openid_client.this: Refreshing state... [id=a148c1a3-803e-4b24-9fe1-3481ca4789fd]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ed47957-f9a3-4a80-aab0-01faf7cf36f3]
module.keycloak_prod.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=78e45507-25cc-49b3-9e47-a834ce647b62]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=098aaf25-e9cf-4e19-9c80-d09f57439190]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c4de20fc-1333-4628-96f7-d919deb8eb01]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4202b7e3-0ce7-437e-b083-3e3e41acb395]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7a053e7d-eb39-4181-aa3c-bd345eb19f83]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ad0f24f5-94ad-47d9-90a3-e9c280a6637b]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdd1b368-149a-4755-899c-397f192c302d]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=769933f1-95b5-4269-a036-65cf70088dd6]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0c81f44b-199f-4958-9041-7597f7acefd5]
module.keycloak_dev.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b215a15e-4ef3-4466-8238-da319ac5a1a4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_junmin-client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "junmin-client"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "junmin-client"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://example.com",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "junmin-client"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "junmin-client"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://example.com",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_junmin-client.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "junmin-client"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "junmin-client"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://example.com",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 6 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 28 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*